package Module1.ComparisonOperators;
// Задание 4 по блоку "Операторы сравнения". Провека на сравнение (РАВНЫ ли...?) двух значений переменных (СТРОК! - с типом переменных "String")
public class NumberComparisons4 {
    public static void main(String[] args) {
        String str1 = "Hello!";
        String str2 = "World!";
        System.out.println( );
        if (str1.equals (str2)) {
            System.out.println("Эти строки равны!");
        } else {
            System.out.println("Эти строки не равны!");
        }
    }
}
// Конец задачи!
