package Module1.ComparisonOperators;
// Задание 3 по блоку "Операторы сравнения". Провека на сравнение (НЕ РАВНЫ ЛИ...?) двух значений переменных (чисел)
public class NumberComparisons3 {
    public static void main(String[] args) {
        int a = 20;
        int b = 30;
        System.out.println( );
        if (a != b) {
            System.out.println("Числа a и b - не равны!");
        } else {
            System.out.println("Числа a и b - равны!");
        }
    }
}
// Конец задачи!
