package Module1.IfOperator;


// Задание 7. Проверка на наличие денег без оператора "else"
public class HavingMoney {
    public static void main(String[] args) {
        System.out.println( );
        boolean hasMoney = true;
        if (hasMoney) {
            System.out.println("Покупаю мороженое!");
        }
    }
}
// Конец задачи!
