package Module1.IfOperator;
// Задание 3. Проверка наличия денег (И!) хорошей погоды.
public class HavingMoneyAndGoodWeather {
    public static void main(String[] args) {
        System.out.println( );
        boolean hasMoney = true;
        boolean isSunny = true;
        if (hasMoney && isSunny) {
            System.out.println("Иду гулять и покупаю мороженое");
        } else {
            System.out.println("Не могу гулять или покупать мороженое :(");
        }
    }
}
// Конец задачи!
