package Module1.Exams;

import java.util.Scanner;

// Напишите программу, которая объявляет метод sum , принимающий два числа и возвращающий их сумму

public class Exams12 {
    public static void main(String[] args) {
        System.out.println();
        int result = sum(3,5);
        System.out.println(result);
    }
    public static int sum (int a, int b){
        return a + b;
    }
}

